Commenting out the two erroneous arguments leads to a successful plan:
```
  # kops_instance_group.nodes["subnet-87b73aed"] will be created
  + resource "kops_instance_group" "nodes" {
      + cluster_name = (known after apply)
      + id           = (known after apply)
      + image        = (known after apply)
      + machine_type = "t3a.small"
      + max_size     = 2
      + min_size     = 0
      + name         = "node-eu-central-1a"
      + revision     = 1
      + role         = "Node"
      + subnets      = [
          + "subnet-87b73aed",
        ]

      + mixed_instances_policy {
          + instances                     = [
              + "t3a.small",
              + "t3.small",
            ]
          + on_demand_allocation_strategy = "lowest-price"
          + spot_allocation_strategy      = "lowest-price"
          + spot_instance_pools           = 2
        }
    }
```